enigma-load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - name: Warm up the API
      duration: 30
      arrivalRate: 5
      rampTo: 10
    - name: Ramp up to peak load
      duration: 30
      arrivalRate: 10
      rampTo: 50
    - name: Sustained peak load
      duration: 120
      rampTo: 50
scenarios:
  - name: Put reported
    flow:
      - post:
          url: "/reviews/report/500000"
          json: